comparison-benchmark/graphql-benchmark/async_graphql_benchmarks/artillery_starwars_benchmark.yml
config:
  processor: "./hooks.js"
  target: 'http://127.0.0.1:8000' # replace with your server URL
  phases:
    - duration: 10
      arrivalRate: 5
      name: Warm up
    - duration: 200
      arrivalRate: 30
      rampTo: 60
      name: Ramp up load
#    - duration: 180
#      arrivalRate: 100
#      name: Sustained load
  defaults:
    headers:
      Content-Type: 'application/json'

scenarios:
  - name: "Get Graphs"
    flow:
      - loop:
        - post:
            url: '/' # replace with your GraphQL endpoint
            afterResponse: [ "checkForGraphQLError" ]
            json:
              query: |
                query gethuman() {
                  human(id: "1000") {
                    name
                  }
                }